DDam_OverInterDyMFoam/CASE00/backgroundAndMovingObject/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    bed1
    {
        type            nutUSpaldingWallFunction;
        value           $internalField;
    }

    bed2
    {
	      type            nutkRoughWallFunction;
	      Ks              uniform 6.1e-3;
	      Cs              uniform 1.0;
	      value           $internalField;
    }

    top
    {
        type            calculated;
        value           $internalField;
    }

    movingObject
    {
        type            nutkWallFunction;
        value           $internalField;
    }

}

// ************************************************************************* //
