DDam_OverInterDyMFoam/CASE00/backgroundAndMovingObject/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionsToCell;
        sourceInfo
        {
            insidePoints ((5.5 0.29 0));
        }
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set c0;
        }
    }

    {
        name    c1;
        type    cellSet;
        action  invert;
    }

    {
        name    c2;
        type    cellSet;
        action  new;
        source  regionsToCell;
        sourceInfo
        {
            insidePoints ((1.946 0 -0.6));
            set          c1;
        }
    }

    {
        name    c1;
        type    cellSet;
        action  delete;
        source  cellToCell;
        sourceInfo
        {
            set c2;
        }
    }

    // Select box to remove from region 1 and 2

    {
        name    box;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set c1;
        }
    }

    {
        name    box;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set c2;
        }
    }

    {
        name    box;
        type    cellSet;
        action  subset;
        source  boxToCell;
        sourceInfo
        {
            boxes
            (
                 (0.99 -100 -0.593) (0.997 100 0.233)
                 (1.98 -100 -0.593) (1.987 100 0.233)
            );
        }
    }

    {
        name    box;
        type    cellSet;
        action  invert;
    }
);
// ************************************************************************* //
